events/test/artillery/p1/1.1.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 1
  processor: "../my-functions.js"
scenarios:
  - flow:
    - loop: 
      - function: "generateData"
      - post:
          url: "/booking"
          json:
              listingId: "{{ listingId }}"
              hostId: "{{ hostId }}"
          order: "sequence"
      count: 10